---
kind: method
id: M:Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.ForwardIterator
source: html/3a872707-d9e4-646d-51f3-bf769e6a8c5f.htm
---
# Autodesk.Revit.DB.Electrical.GroundConductorSizeSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual GroundConductorSizeSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.